src/tr069/templates/tr069_transfer_complete_rep_template.xml

<soapenv:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/encoding/" xmlns:cwmp="urn:dslforum-org:cwmp-1-0" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <cwmp:ID soapenv:mustUnderstand="1">{TR069CPEReqIDDP}</cwmp:ID>
    </soapenv:Header>
    <soapenv:Body>
     <cwmp:TransferComplete>
       <CommandKey>{TR069CmdKeyDP}</CommandKey>
       <cwmp:FaultStruct>
           <FaultCode>0</FaultCode>
           <FaultString></FaultString>
       </cwmp:FaultStruct>
       <StartTime>{TR069CurrentTimeDTP}</StartTime>
       <CompleteTime>{TR069CurrentTimeDTP}</CompleteTime>
     </cwmp:TransferComplete>
  </soapenv:Body>
</soapenv:Envelope>
